RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7r7xx.h
/**
  ******************************************************************************
  * @file    stm32h7r7xx.h
  * @author  MCD Application Team
  * @brief   CMSIS STM32H7R7xx Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef STM32H7R7xx_H
#define STM32H7R7xx_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/** @addtogroup ST
  * @{
  */


/** @addtogroup STM32H7R7xx
  * @{
  */


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum
{
/* =======================================  ARM Cortex-M7 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                 = -15,    /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn        = -14,    /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn             = -13,    /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn      = -12,    /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                 and No Match                                                         */
  BusFault_IRQn              = -11,    /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                 related Fault                                                        */
  UsageFault_IRQn            = -10,    /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn                =  -5,    /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn          =  -4,    /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn                =  -2,    /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn               =  -1,    /*!< -1 System Tick Timer                                                      */

/* ===========================================  STM32H7R7xx Specific Interrupt Numbers  ====================================== */
  PVD_PVM_IRQn               = 0,      /*!< PVD/PVM through EXTI Line detection                              */
  DTS_IRQn                   = 2,      /*!< Digital Temperature Sensor interrupt                             */
  IWDG_IRQn                  = 3,      /*!< Internal Watchdog interrupt                                      */
  WWDG_IRQn                  = 4,      /*!< Window Watchdog interrupt                                        */
  RCC_IRQn                   = 5,      /*!< RCC global interrupts through EXTI Line detection                */
  FLASH_IRQn                 = 8,      /*!< FLASH interrupts                                                 */
  RAMECC_IRQn                = 9,      /*!< RAMECC interrupts                                                */
  FPU_IRQn                   = 10,     /*!< FPU interrupt                                                    */
  TAMP_IRQn                  = 13,     /*!< Tamper and TimeStamp interrupts through EXTI Line detection      */
  EXTI0_IRQn                 = 16,     /*!< EXTI Line0 interrupt                                             */
  EXTI1_IRQn                 = 17,     /*!< EXTI Line1 interrupt                                             */
  EXTI2_IRQn                 = 18,     /*!< EXTI Line2 interrupt                                             */
  EXTI3_IRQn                 = 19,     /*!< EXTI Line3 interrupt                                             */
  EXTI4_IRQn                 = 20,     /*!< EXTI Line4 interrupt                                             */
  EXTI5_IRQn                 = 21,     /*!< EXTI Line5 interrupt                                             */
  EXTI6_IRQn                 = 22,     /*!< EXTI Line6 interrupt                                             */
  EXTI7_IRQn                 = 23,     /*!< EXTI Line7 interrupt                                             */
  EXTI8_IRQn                 = 24,     /*!< EXTI Line8 interrupt                                             */
  EXTI9_IRQn                 = 25,     /*!< EXTI Line9 interrupt                                             */
  EXTI10_IRQn                = 26,     /*!< EXTI Line10 interrupt                                            */
  EXTI11_IRQn                = 27,     /*!< EXTI Line11 interrupt                                            */
  EXTI12_IRQn                = 28,     /*!< EXTI Line12 interrupt                                            */
  EXTI13_IRQn                = 29,     /*!< EXTI Line13 interrupt                                            */
  EXTI14_IRQn                = 30,     /*!< EXTI Line14 interrupt                                            */
  EXTI15_IRQn                = 31,     /*!< EXTI Line15 interrupt                                            */
  RTC_IRQn                   = 32,     /*!< RTC Wakeup and Alarm interrupts through EXTI Line detection      */
  PKA_IRQn                   = 35,     /*!< PKA interrupt                                                    */
  HASH_IRQn                  = 36,     /*!< HASH interrupt                                                   */
  RNG_IRQn                   = 37,     /*!< RNG global interrupt                                             */
  ADC1_2_IRQn                = 38,     /*!< ADC1 & ADC2 interrupt                                            */
  GPDMA1_Channel0_IRQn       = 39,     /*!< GPDMA1 Channel 0 interrupt                                       */
  GPDMA1_Channel1_IRQn       = 40,     /*!< GPDMA1 Channel 1 interrupt                                       */
  GPDMA1_Channel2_IRQn       = 41,     /*!< GPDMA1 Channel 2 interrupt                                       */
  GPDMA1_Channel3_IRQn       = 42,     /*!< GPDMA1 Channel 3 interrupt                                       */
  GPDMA1_Channel4_IRQn       = 43,     /*!< GPDMA1 Channel 4 interrupt                                       */
  GPDMA1_Channel5_IRQn       = 44,     /*!< GPDMA1 Channel 5 interrupt                                       */
  GPDMA1_Channel6_IRQn       = 45,     /*!< GPDMA1 Channel 6 interrupt                                       */
  GPDMA1_Channel7_IRQn       = 46,     /*!< GPDMA1 Channel 7 interrupt                                       */
  TIM1_BRK_IRQn              = 47,     /*!< TIM1 Break interrupt                                             */
  TIM1_UP_IRQn               = 48,     /*!< TIM1 Update interrupt                                            */
  TIM1_TRG_COM_IRQn          = 49,     /*!< TIM1 Trigger and Commutation interrupt                           */
  TIM1_CC_IRQn               = 50,     /*!< TIM1 Capture Compare interrupt                                   */
  TIM2_IRQn                  = 51,     /*!< TIM2 global interrupt                                            */
  TIM3_IRQn                  = 52,     /*!< TIM3 global interrupt                                            */
  TIM4_IRQn                  = 53,     /*!< TIM4 global interrupt                                            */
  TIM5_IRQn                  = 54,     /*!< TIM5 global interrupt                                            */
  TIM6_IRQn                  = 55,     /*!< TIM6 global interrupt                                            */
  TIM7_IRQn                  = 56,     /*!< TIM7 global interrupt                                            */
  TIM9_IRQn                  = 57,     /*!< TIM9 global interrupt                                            */
  SPI1_IRQn                  = 58,     /*!< SPI1 global interrupt                                            */
  SPI2_IRQn                  = 59,     /*!< SPI2 global interrupt                                            */
  SPI3_IRQn                  = 60,     /*!< SPI3 global interrupt                                            */
  SPI4_IRQn                  = 61,     /*!< SPI4 global interrupt                                            */
  SPI5_IRQn                  = 62,     /*!< SPI5 global interrupt                                            */
  SPI6_IRQn                  = 63,     /*!< SPI6 global interrupt                                            */
  HPDMA1_Channel0_IRQn       = 64,     /*!< HPDMA1 Channel 0 global interrupt                                */
  HPDMA1_Channel1_IRQn       = 65,     /*!< HPDMA1 Channel 1 global interrupt                                */
  HPDMA1_Channel2_IRQn       = 66,     /*!< HPDMA1 Channel 2 global interrupt                                */
  HPDMA1_Channel3_IRQn       = 67,     /*!< HPDMA1 Channel 3 global interrupt                                */
  HPDMA1_Channel4_IRQn       = 68,     /*!< HPDMA1 Channel 4 global interrupt                                */
  HPDMA1_Channel5_IRQn       = 69,     /*!< HPDMA1 Channel 5 global interrupt                                */
  HPDMA1_Channel6_IRQn       = 70,     /*!< HPDMA1 Channel 6 global interrupt                                */
  HPDMA1_Channel7_IRQn       = 71,     /*!< HPDMA1 Channel 7 global interrupt                                */
  SAI1_A_IRQn                = 72,     /*!< Serial Audio Interface 1 block A interrupt                       */
  SAI1_B_IRQn                = 73,     /*!< Serial Audio Interface 1 block B interrupt                       */
  SAI2_A_IRQn                = 74,     /*!< Serial Audio Interface 2 block A interrupt                       */
  SAI2_B_IRQn                = 75,     /*!< Serial Audio Interface 2 block B interrupt                       */
  I2C1_EV_IRQn               = 76,     /*!< I2C1 event interrupt                                             */
  I2C1_ER_IRQn               = 77,     /*!< I2C1 error interrupt                                             */
  I2C2_EV_IRQn               = 78,     /*!< I2C2 event interrupt                                             */
  I2C2_ER_IRQn               = 79,     /*!< I2C2 error interrupt                                             */
  I2C3_EV_IRQn               = 80,     /*!< I2C3 event interrupt                                             */
  I2C3_ER_IRQn               = 81,     /*!< I2C3 error interrupt                                             */
  USART1_IRQn                = 82,     /*!< USART1 global interrupt                                          */
  USART2_IRQn                = 83,     /*!< USART2 global interrupt                                          */
  USART3_IRQn                = 84,     /*!< USART3 global interrupt                                          */
  UART4_IRQn                 = 85,     /*!< UART4 global interrupt                                           */
  UART5_IRQn                 = 86,     /*!< UART5 global interrupt                                           */
  UART7_IRQn                 = 87,     /*!< UART7 global interrupt                                           */
  UART8_IRQn                 = 88,     /*!< UART8 global interrupt                                           */
  I3C1_EV_IRQn               = 89,     /*!< I3C1 event interrupt                                             */
  I3C1_ER_IRQn               = 90,     /*!< I3C1 error interrupt                                             */
  OTG_HS_IRQn                = 91,     /*!< USB OTG HS interrupt                                             */
  ETH_IRQn                   = 92,     /*!< Ethernet global interrupt                                        */
  CORDIC_IRQn                = 93,     /*!< CORDIC global interrupt                                          */
  GFXTIM_IRQn                = 94,     /*!< GFXTIM global interrupt                                          */
  DCMIPP_IRQn                = 95,     /*!< DCMIPP global interrupt                                          */
  LTDC_IRQn                  = 96,     /*!< LTDC global interrupt                                            */
  LTDC_ER_IRQn               = 97,     /*!< LTDC error global interrupt                                      */
  DMA2D_IRQn                 = 98,     /*!< DMA2D global interrupt                                           */
  JPEG_IRQn                  = 99,     /*!< JPEG global interrupt                                            */
  GFXMMU_IRQn                = 100,    /*!< GFXMMU global interrupt                                          */
  I3C1_WKUP_IRQn             = 101,    /*!< I3C1 wakeup global interrupt                                     */
  XSPI1_IRQn                 = 105,    /*!< XSPI1 global interrupt                                           */
  XSPI2_IRQn                 = 106,    /*!< XSPI2 global interrupt                                           */
  FMC_IRQn                   = 107,    /*!< FMC global interrupt                                             */
  SDMMC1_IRQn                = 108,    /*!< SDMMC1 global interrupt                                          */
  SDMMC2_IRQn                = 109,    /*!< SDMMC2 global interrupt                                          */
  OTG_FS_IRQn                = 112,    /*!< USB OTG FS interrupt                                             */
  TIM12_IRQn                 = 113,    /*!< TIM12 global interrupt                                           */
  TIM13_IRQn                 = 114,    /*!< TIM13 global interrupt                                           */
  TIM14_IRQn                 = 115,    /*!< TIM14 global interrupt                                           */
  TIM15_IRQn                 = 116,    /*!< TIM15 global interrupt                                           */
  TIM16_IRQn                 = 117,    /*!< TIM16 global interrupt                                           */
  TIM17_IRQn                 = 118,    /*!< TIM17 global interrupt                                           */
  LPTIM1_IRQn                = 119,    /*!< LPTIM1 global interrupt                                          */
  LPTIM2_IRQn                = 120,    /*!< LPTIM2 global interrupt                                          */
  LPTIM3_IRQn                = 121,    /*!< LPTIM3 global interrupt                                          */
  LPTIM4_IRQn                = 122,    /*!< LPTIM4 global interrupt                                          */
  LPTIM5_IRQn                = 123,    /*!< LPTIM5 global interrupt                                          */
  SPDIF_RX_IRQn              = 124,    /*!< SPDIF_RX global interrupt                                        */
  MDIOS_IRQn                 = 125,    /*!< MDIOS global interrupt                                           */
  ADF1_FLT0_IRQn             = 126,    /*!< ADF1 Filter 0 global Interrupt                                   */
  CRS_IRQn                   = 127,    /*!< CRS global interrupt                                             */
  UCPD1_IRQn                 = 128,    /*!< UCPD1 global interrupt                                           */
  CEC_IRQn                   = 129,    /*!< HDMI_CEC global Interrupt                                        */
  PSSI_IRQn                  = 130,    /*!< PSSI global interrupt                                            */
  LPUART1_IRQn               = 131,    /*!< LPUART1 global interrupt                                         */
  WAKEUP_PIN_IRQn            = 132,    /*!< Wake-up pins interrupt                                           */
  GPDMA1_Channel8_IRQn       = 133,    /*!< GPDMA1 Channel 8 global interrupt                                */
  GPDMA1_Channel9_IRQn       = 134,    /*!< GPDMA1 Channel 9 global interrupt                                */
  GPDMA1_Channel10_IRQn      = 135,    /*!< GPDMA1 Channel 10 global interrupt                               */
  GPDMA1_Channel11_IRQn      = 136,    /*!< GPDMA1 Channel 11 global interrupt                               */
  GPDMA1_Channel12_IRQn      = 137,    /*!< GPDMA1 Channel 12 global interrupt                               */
  GPDMA1_Channel13_IRQn      = 138,    /*!< GPDMA1 Channel 13 global interrupt                               */
  GPDMA1_Channel14_IRQn      = 139,    /*!< GPDMA1 Channel 14 global interrupt                               */
  GPDMA1_Channel15_IRQn      = 140,    /*!< GPDMA1 Channel 15 global interrupt                               */
  HPDMA1_Channel8_IRQn       = 141,    /*!< HPDMA1 Channel 8 global interrupt                                */
  HPDMA1_Channel9_IRQn       = 142,    /*!< HPDMA1 Channel 9 global interrupt                                */
  HPDMA1_Channel10_IRQn      = 143,    /*!< HPDMA1 Channel 10 global interrupt                               */
  HPDMA1_Channel11_IRQn      = 144,    /*!< HPDMA1 Channel 11 global interrupt                               */
  HPDMA1_Channel12_IRQn      = 145,    /*!< HPDMA1 Channel 12 global interrupt                               */
  HPDMA1_Channel13_IRQn      = 146,    /*!< HPDMA1 Channel 13 global interrupt                               */
  HPDMA1_Channel14_IRQn      = 147,    /*!< HPDMA1 Channel 14 global interrupt                               */
  HPDMA1_Channel15_IRQn      = 148,    /*!< HPDMA1 Channel 15 global interrupt                               */
  GPU2D_IRQn                 = 149,    /*!< GPU2D interrupt                                                  */
  GPU2D_ER_IRQn              = 150,    /*!< GPU2D error interrupt                                            */
  ICACHE_IRQn                = 151,    /*!< ICACHE interrupt                                                 */
  FDCAN1_IT0_IRQn            = 152,    /*!< FDCAN1 interrupt 0                                               */
  FDCAN1_IT1_IRQn            = 153,    /*!< FDCAN1 interrupt 1                                               */
  FDCAN2_IT0_IRQn            = 154,    /*!< FDCAN2 interrupt 0                                               */
  FDCAN2_IT1_IRQn            = 155     /*!< FDCAN2 interrupt 1                                               */
} IRQn_Type;


/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/**
  * @brief Configuration of the Cortex-M7 Processor and Core Peripherals
   */
#define __CM7_REV                 0x0102U /*!< Cortex-M7 revision r1p2                       */
#define __MPU_PRESENT             1U      /*!< CM7 provides an MPU                           */
#define __MPU_REGIONCOUNT        16U      /*!< CM7 provides MPU region number                */
#define __NVIC_PRIO_BITS          4U      /*!< CM7 uses 4 Bits for the Priority Levels       */
#define __Vendor_SysTickConfig    0U      /*!< Set to 1 if different SysTick Config is used  */
#define __FPU_PRESENT             1U      /*!< FPU present                                   */
#define __ICACHE_PRESENT          1U      /*!< CM7 instruction cache present                 */
#define __DCACHE_PRESENT          1U      /*!< CM7 data cache present                        */

/** @} */ /* End of group Configuration_of_CMSIS */


#include <core_cm7.h>                     /*!< ARM Cortex-M7 processor and core peripherals  */
#include "system_stm32h7rsxx.h"             /*!< STM32H7RSxx System */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup STM32H7RSxx_peripherals
  * @{
  */

/**
  * @brief Analog to Digital Converter
  */

