RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7r7xx.h
typedef struct
{
  __IO uint32_t ISR;          /*!< ADC interrupt and status register,             Address offset: 0x00 */
  __IO uint32_t IER;          /*!< ADC interrupt enable register,                 Address offset: 0x04 */
  __IO uint32_t CR;           /*!< ADC control register,                          Address offset: 0x08 */
  __IO uint32_t CFGR;         /*!< ADC configuration register 1,                  Address offset: 0x0C */
  __IO uint32_t CFGR2;        /*!< ADC configuration register 2,                  Address offset: 0x10 */
  __IO uint32_t SMPR1;        /*!< ADC sampling time register 1,                  Address offset: 0x14 */
  __IO uint32_t SMPR2;        /*!< ADC sampling time register 2,                  Address offset: 0x18 */
       uint32_t RESERVED1;    /*!< Reserved,                                                      0x1C */
  __IO uint32_t TR1;          /*!< ADC analog watchdog 1 threshold register,      Address offset: 0x20 */
  __IO uint32_t TR2;          /*!< ADC analog watchdog 2 threshold register,      Address offset: 0x24 */
  __IO uint32_t TR3;          /*!< ADC analog watchdog 3 threshold register,      Address offset: 0x28 */
       uint32_t RESERVED2;    /*!< Reserved,                                                      0x2C */
  __IO uint32_t SQR1;         /*!< ADC group regular sequencer register 1,        Address offset: 0x30 */
  __IO uint32_t SQR2;         /*!< ADC group regular sequencer register 2,        Address offset: 0x34 */
  __IO uint32_t SQR3;         /*!< ADC group regular sequencer register 3,        Address offset: 0x38 */
  __IO uint32_t SQR4;         /*!< ADC group regular sequencer register 4,        Address offset: 0x3C */
  __IO uint32_t DR;           /*!< ADC group regular data register,               Address offset: 0x40 */
       uint32_t RESERVED3;    /*!< Reserved,                                                      0x44 */
       uint32_t RESERVED4;    /*!< Reserved,                                                      0x48 */
  __IO uint32_t JSQR;         /*!< ADC group injected sequencer register,         Address offset: 0x4C */
       uint32_t RESERVED5[4]; /*!< Reserved,                                               0x50 - 0x5C */
  __IO uint32_t OFR1;         /*!< ADC offset register 1,                         Address offset: 0x60 */
  __IO uint32_t OFR2;         /*!< ADC offset register 2,                         Address offset: 0x64 */
  __IO uint32_t OFR3;         /*!< ADC offset register 3,                         Address offset: 0x68 */
  __IO uint32_t OFR4;         /*!< ADC offset register 4,                         Address offset: 0x6C */
       uint32_t RESERVED6[4]; /*!< Reserved,                                               0x70 - 0x7C */
  __IO uint32_t JDR1;         /*!< ADC group injected rank 1 data register,       Address offset: 0x80 */
  __IO uint32_t JDR2;         /*!< ADC group injected rank 2 data register,       Address offset: 0x84 */
  __IO uint32_t JDR3;         /*!< ADC group injected rank 3 data register,       Address offset: 0x88 */
  __IO uint32_t JDR4;         /*!< ADC group injected rank 4 data register,       Address offset: 0x8C */
       uint32_t RESERVED7[4]; /*!< Reserved,                                             0x090 - 0x09C */
  __IO uint32_t AWD2CR;       /*!< ADC analog watchdog 2 configuration register,  Address offset: 0xA0 */
  __IO uint32_t AWD3CR;       /*!< ADC analog watchdog 3 Configuration Register,  Address offset: 0xA4 */
       uint32_t RESERVED8;    /*!< Reserved,                                                     0x0A8 */
       uint32_t RESERVED9;    /*!< Reserved,                                                     0x0AC */
  __IO uint32_t DIFSEL;       /*!< ADC differential mode selection register,      Address offset: 0xB0 */
  __IO uint32_t CALFACT;      /*!< ADC calibration factors,                       Address offset: 0xB4 */
       uint32_t RESERVED10[4];/*!< Reserved,                                             0x0B8 - 0x0BC */
  __IO uint32_t OR;           /*!< ADC option register,                           Address offset: 0xC8 */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CSR;          /*!< ADC common status register,            Address offset: 0x300 + 0x00 */
  uint32_t      RESERVED1;    /*!< Reserved,                              Address offset: 0x300 + 0x04 */
  __IO uint32_t CCR;          /*!< ADC common configuration register,     Address offset: 0x300 + 0x08 */
  __IO uint32_t CDR;          /*!< ADC common group regular data register Address offset: 0x300 + 0x0C */
} ADC_Common_TypeDef;

/**
  * @brief AXIM ASIB
  */
typedef struct
{
  uint32_t RESERVED1[9];       /*!< Reserved,                             Address offset: 0x00-0x20 */
  __IO uint32_t FNMOD2;        /*!< AXIM ASIB fn_mod2 register            Address offset: 0x24 */
  uint32_t RESERVED3[54];      /*!< Reserved,                             Address offset: 0x28-0xFC */
  __IO uint32_t READQOS;       /*!< AXIM ASIB read_qos register           Address offset: 0x100 */
  __IO uint32_t WRITEQOS;      /*!< AXIM ASIB write_qos register          Address offset: 0x104 */
  __IO uint32_t FNMOD;         /*!< AXIM ASIB fn_mod register             Address offset: 0x108 */
} AXIM_ASIB_TypeDef;

typedef struct
{
  uint32_t RESERVED1[2];       /*!< Reserved,                             Address offset: 0x00-0x04 */
  __IO uint32_t FNMODBMISS;    /*!< AXIM AMIB fn_mod_bm_iss register      Address offset: 0x08 */
  uint32_t RESERVED2[6];       /*!< Reserved,                             Address offset: 0x0C-0x20 */
  __IO uint32_t FNMOD2;        /*!< AXIM AMIB fn_mod2 register            Address offset: 0x24 */
  uint32_t RESERVED3[1];       /*!< Reserved,                             Address offset: 0x28 */
  __IO uint32_t FNMODLB;       /*!< AXIM AMIB fn_mod_lb register          Address offset: 0x2C */
  uint32_t RESERVED5[54];      /*!< Reserved,                             Address offset: 0x30-0x104 */
  __IO uint32_t FNMOD;         /*!< AXIM AMIB fn_mod register             Address offset: 0x108 */
} AXIM_AMIB_TypeDef;

/**
  * @brief VREFBUF
  */

typedef struct
{
  __IO uint32_t CSR;         /*!< VREFBUF control and status register,         Address offset: 0x00 */
  __IO uint32_t CCR;         /*!< VREFBUF calibration and control register,    Address offset: 0x04 */
} VREFBUF_TypeDef;

/**
  * @brief Consumer Electronics Control
  */

typedef struct
{
  __IO uint32_t CR;            /*!< CEC control register,                           Address offset:0x00 */
  __IO uint32_t CFGR;          /*!< CEC configuration register,                     Address offset:0x04 */
  __IO uint32_t TXDR;          /*!< CEC Tx data register ,                          Address offset:0x08 */
  __IO uint32_t RXDR;          /*!< CEC Rx Data Register,                           Address offset:0x0C */
  __IO uint32_t ISR;           /*!< CEC Interrupt and Status Register,              Address offset:0x10 */
  __IO uint32_t IER;           /*!< CEC interrupt enable register,                  Address offset:0x14 */
} CEC_TypeDef;

/**
  * @brief CORDIC
  */
typedef struct
{
  __IO uint32_t CSR;           /*!< CORDIC Control and Status register,             Address offset: 0x00 */
  __IO uint32_t WDATA;         /*!< CORDIC argument register,                       Address offset: 0x04 */
  __IO uint32_t RDATA;         /*!< CORDIC result register,                         Address offset: 0x08 */
} CORDIC_TypeDef;

/**
  * @brief GFXTIM
  */
typedef struct
{
  __IO uint32_t CR;            /*!< GFXTIM configuration register,                    Address offset: 0x00 */
  __IO uint32_t CGCR;          /*!< GFXTIM clock generator configuration register,    Address offset: 0x04 */
  __IO uint32_t TCR;           /*!< GFXTIM timers configuration register,             Address offset: 0x08 */
  __IO uint32_t TDR;           /*!< GFXTIM timers disable register,                   Address offset: 0x0C */
  __IO uint32_t EVCR;          /*!< GFXTIM events control register,                   Address offset: 0x10 */
  __IO uint32_t EVSR;          /*!< GFXTIM events selection register,                 Address offset: 0x14 */
  uint32_t RESERVED1[2];       /*!< Reserved,                                         Address offset: 0x18-0x1C */
  __IO uint32_t WDGTCR;        /*!< GFXTIM watchdog timer configuration register,     Address offset: 0x20 */
  uint32_t RESERVED2[3];       /*!< Reserved,                                         Address offset: 0x24-0x2C */
  __IO uint32_t ISR;           /*!< GFXTIM interrupt status register,                 Address offset: 0x30 */
  __IO uint32_t ICR;           /*!< GFXTIM interrupt clear register,                  Address offset: 0x34 */
  __IO uint32_t IER;           /*!< GFXTIM interrupt enable register,                 Address offset: 0x38 */
  __IO uint32_t TSR;           /*!< GFXTIM timers status register,                    Address offset: 0x3C */
  __IO uint32_t LCCRR;         /*!< GFXTIM line clock counter reload register,        Address offset: 0x40 */
  __IO uint32_t FCCRR;         /*!< GFXTIM frame clock counter reload register,       Address offset: 0x44 */
  uint32_t RESERVED3[2];       /*!< Reserved,                                         Address offset: 0x48-0x4C */
  __IO uint32_t ATR;           /*!< GFXTIM absolute time register,                    Address offset: 0x50 */
  __IO uint32_t AFCR;          /*!< GFXTIM absolute frame counter register,           Address offset: 0x54 */
  __IO uint32_t ALCR;          /*!< GFXTIM absolute line counter register,            Address offset: 0x58 */
  uint32_t RESERVED4[1];       /*!< Reserved,                                         Address offset: 0x5C */
  __IO uint32_t AFCC1R;        /*!< GFXTIM absolute frame counter compare 1 register, Address offset: 0x60 */
  uint32_t RESERVED5[3];       /*!< Reserved,                                         Address offset: 0x64-0X6C */
  __IO uint32_t ALCC1R;        /*!< GFXTIM absolute line counter compare 1 register,  Address offset: 0x70 */
  __IO uint32_t ALCC2R;        /*!< GFXTIM absolute line counter compare 2 register,  Address offset: 0x74 */
  uint32_t RESERVED6[2];       /*!< Reserved,                                         Address offset: 0x78-0X7C */
  __IO uint32_t RFC1R;         /*!< GFXTIM relative frame counter 1 register,         Address offset: 0x80 */
  __IO uint32_t RFC1RR;        /*!< GFXTIM relative frame counter 1 reload register,  Address offset: 0x84 */
  __IO uint32_t RFC2R;         /*!< GFXTIM relative frame counter 2 register,         Address offset: 0x88 */
  __IO uint32_t RFC2RR;        /*!< GFXTIM relative frame counter 2 reload register,  Address offset: 0x8C */
  uint32_t RESERVED7[4];       /*!< Reserved,                                         Address offset: 0x90-0X9C */
  __IO uint32_t WDGCR;         /*!< GFXTIM watchdog counter register,                 Address offset: 0xA0 */
  __IO uint32_t WDGRR;         /*!< GFXTIM watchdog reload register,                  Address offset: 0xA4 */
  __IO uint32_t WDGPAR;        /*!< GFXTIM watchdog pre-alarm register,               Address offset: 0xA8 */
  uint32_t RESERVED8[209];     /*!< Reserved,                                         Address offset: 0xAC-0X3EC */
  __IO uint32_t HWCFGR;        /*!< GFXTIM HW configuration register,                 Address offset: 0x3F0 */
  __IO uint32_t VERR;          /*!< GFXTIM version register,                          Address offset: 0x3F4 */
  __IO uint32_t IPIDR;         /*!< GFXTIM identification register,                   Address offset: 0x3F8 */
  __IO uint32_t SIDR;          /*!< GFXTIM size identification register,              Address offset: 0x3FC */
} GFXTIM_TypeDef;


/**
  * @brief CRC calculation unit
  */
typedef struct
{
  __IO uint32_t DR;            /*!< CRC Data register,                              Address offset: 0x00 */
  __IO uint32_t IDR;           /*!< CRC Independent data register,                  Address offset: 0x04 */
  __IO uint32_t CR;            /*!< CRC Control register,                           Address offset: 0x08 */
       uint32_t RESERVED1;     /*!< Reserved,                                                       0x0C */
  __IO uint32_t INIT;          /*!< Initial CRC value register,                     Address offset: 0x10 */
  __IO uint32_t POL;           /*!< CRC polynomial register,                        Address offset: 0x14 */
} CRC_TypeDef;

/**
  * @brief Clock Recovery System
  */
typedef struct
{
  __IO uint32_t CR;            /*!< CRS ccontrol register,                          Address offset: 0x00 */
  __IO uint32_t CFGR;          /*!< CRS configuration register,                     Address offset: 0x04 */
  __IO uint32_t ISR;           /*!< CRS interrupt and status register,              Address offset: 0x08 */
  __IO uint32_t ICR;           /*!< CRS interrupt flag clear register,              Address offset: 0x0C */
} CRS_TypeDef;

/**
  * @brief Debug MCU
  */
typedef struct
{
  __IO uint32_t IDCODE;        /*!< MCU device ID code,                             Address offset: 0x00 */
  __IO uint32_t CR;            /*!< Debug MCU configuration register,               Address offset: 0x04 */
  uint32_t RESERVED1[5];       /*!< Reserved,                                       Address offset: 0x08-0x18 */
  __IO uint32_t AHB5FZR;       /*!< Debug MCU AHB5FZR freeze register,              Address offset: 0x1C */
  uint32_t RESERVED2;          /*!< Reserved,                                       Address offset: 0x20 */
  __IO uint32_t AHB1FZR;       /*!< Debug MCU AHB1FZR freeze register,              Address offset: 0x24 */
  uint32_t RESERVED3[5];       /*!< Reserved,                                       Address offset: 0x28-0x38 */
  __IO uint32_t APB1FZR;       /*!< Debug MCU APB1FZR freeze register,              Address offset: 0x3C */
  uint32_t RESERVED4[3];       /*!< Reserved,                                       Address offset: 0x40-0x48 */
  __IO uint32_t APB2FZR;       /*!< Debug MCU APB2FZR freeze register,              Address offset: 0x4C */
  uint32_t RESERVED5;          /*!< Reserved,                                       Address offset: 0x50 */
  __IO uint32_t APB4FZR;       /*!< Debug MCU APB4FZR freeze register,              Address offset: 0x54 */
  uint32_t RESERVED6[41];      /*!< Reserved,                                       Address offset: 0x58-0xF8 */
  __IO uint32_t SR;            /*!< Debug MCU status register,                      Address offset: 0xFC */
  __IO uint32_t DBG_AUTH_HOST; /*!< Debug MCU Authentication Host register,         Address offset: 0x100 */
  __IO uint32_t DBG_AUTH_DEV;  /*!< Debug MCU Authentication Device register,       Address offset: 0x104 */
  __IO uint32_t DBG_AUTH_ACK;  /*!< Debug MCU Authentication Ack register,          Address offset: 0x108 */
  uint32_t RESERVED7[945];     /*!< Reserved,                                       Address offset: 0x10C-0xFCC */
  __IO uint32_t PIDR4;         /*!< Debug MCU peripheral identity register 4,       Address offset: 0xFD0 */
  uint32_t RESERVED8[3];       /*!< Reserved,                                       Address offset: 0xFD4-0xFDC */
  __IO uint32_t PIDR0;         /*!< Debug MCU peripheral identity register 0,       Address offset: 0xFE0 */
  __IO uint32_t PIDR1;         /*!< Debug MCU peripheral identity register 1,       Address offset: 0xFE4 */
  __IO uint32_t PIDR2;         /*!< Debug MCU peripheral identity register 2,       Address offset: 0xFE8 */
  __IO uint32_t PIDR3;         /*!< Debug MCU peripheral identity register 3,       Address offset: 0xFEC */
  __IO uint32_t CIDR0;         /*!< Debug MCU component identity register 0,        Address offset: 0xFF0 */
  __IO uint32_t CIDR1;         /*!< Debug MCU component identity register 1,        Address offset: 0xFF4 */
  __IO uint32_t CIDR2;         /*!< Debug MCU component identity register 2,        Address offset: 0xFF8 */
  __IO uint32_t CIDR3;         /*!< Debug MCU component identity register 3,        Address offset: 0xFFC */
} DBGMCU_TypeDef;

/**
  * @brief DCMIPP
  */
typedef struct
{
  __IO uint32_t IPGR1;         /*!< IP-Plug global register 1                         Address offset: 0x00 */
  __IO uint32_t IPGR2;         /*!< IP-Plug global register 2                         Address offset: 0x04 */
  __IO uint32_t IPGR3;         /*!< IP-Plug global register 3                         Address offset: 0x08 */
  uint32_t RESERVED1[4];       /*!< Reserved,                                    Address offset: 0x0C-0x18 */
  __IO uint32_t IPGR8;         /*!< IP-Plug global register 8                         Address offset: 0x1C */
  __IO uint32_t IPC1R1;        /*!< IP-Plug client 1 register 1                       Address offset: 0x20 */
  __IO uint32_t IPC1R2;        /*!< IP-Plug client 1 register 2                       Address offset: 0x24 */
  __IO uint32_t IPC1R3;        /*!< IP-Plug client 1 register 3                       Address offset: 0x28 */
  __IO uint32_t RESERVED2[54]; /*!< Reserved,                                   Address offset: 0x2C-0x100 */
  __IO uint32_t PRCR;          /*!< Parallel interface control register              Address offset: 0x104 */
  __IO uint32_t PRESCR;        /*!< Parallel interface embedded sync code register   Address offset: 0x108 */
  __IO uint32_t PRESUR;        /*!< Parallel interface embedded sync unmask register Address offset: 0x10C */
  __IO uint32_t RESERVED3[57]; /*!< Reserved,                                  Address offset: 0x110-0x1F0 */
  __IO uint32_t PRIER;         /*!< Parallel interface interrupt enable register     Address offset: 0x1F4 */
  __IO uint32_t PRSR;          /*!< Parallel interface status register               Address offset: 0x1F8 */
  __IO uint32_t PRFCR;         /*!< Parallel interface interrupt clear register      Address offset: 0x1FC */
  uint32_t RESERVED4;          /*!< Reserved,                                        Address offset: 0x200 */
  __IO uint32_t CMCR;          /*!< Common configuration register                    Address offset: 0x204 */
  __IO uint32_t CMFRCR;        /*!< Common frame counter register                    Address offset: 0x208 */
  __IO uint32_t RESERVED5[121]; /*!< Reserved,                                 Address offset: 0x20C-0x3EC */
  __IO uint32_t CMIER;         /*!< Common interrupt enable register                 Address offset: 0x3F0 */
  __IO uint32_t CMSR1;         /*!< Common status register 1                         Address offset: 0x3F4 */
  __IO uint32_t CMSR2;         /*!< Common status register 2                         Address offset: 0x3F8 */
  __IO uint32_t CMFCR;         /*!< Common interrupt clear register                  Address offset: 0x3FC */
  uint32_t RESERVED6;          /*!< Reserved,                                        Address offset: 0x400 */
  __IO uint32_t P0FSCR;        /*!< Pipe0 flow selection configuration register      Address offset: 0x404 */
  __IO uint32_t RESERVED7[62]; /*!< Reserved,                                  Address offset: 0x408-0x4FC */
  __IO uint32_t P0FCTCR;       /*!< Pipe0 flow control configuration register        Address offset: 0x500 */
  __IO uint32_t P0SCSTR;       /*!< Pipe0 stat/crop start register                   Address offset: 0x504 */
  __IO uint32_t P0SCSZR;       /*!< Pipe0 stat/crop size register                    Address offset: 0x508 */
  __IO uint32_t RESERVED8[41]; /*!< Reserved,                                  Address offset: 0x50C-0x5AC */
  __IO uint32_t P0DCCNTR;      /*!< Pipe0 dump counter register                      Address offset: 0x5B0 */
  __IO uint32_t P0DCLMTR;      /*!< Pipe0 dump limit register                        Address offset: 0x5B4 */
  __IO uint32_t RESERVED9[2];  /*!< Reserved,                                  Address offset: 0x5B8-0x5BC */
  __IO uint32_t P0PPCR;        /*!< Pipe0 pixel packer configuration register        Address offset: 0x5C0 */
  __IO uint32_t P0PPM0AR1;     /*!< Pipe0 pixel packer memory0 address register 1    Address offset: 0x5C4 */
  __IO uint32_t P0PPM0AR2;     /*!< Pipe0 pixel packer memory0 address register 2    Address offset: 0x5C8 */
  __IO uint32_t RESERVED10[10]; /*!< Reserved,                                 Address offset: 0x5CC-0x5F0 */
  __IO uint32_t P0IER;         /*!< Pipe0 interrupt enable register                  Address offset: 0x5F4 */
  __IO uint32_t P0SR;          /*!< Pipe0 status register                            Address offset: 0x5F8 */
  __IO uint32_t P0FCR;         /*!< Pipe0 interrupt clear register                   Address offset: 0x5FC */
  __IO uint32_t RESERVED11[64]; /*!< Reserved,                                 Address offset: 0x600-0x6FC */
  __IO uint32_t P0CFCTCR;      /*!< Pipe0 current flow control configuration register Address offset: 0x700 */
  __IO uint32_t P0CSCSTR;      /*!< Pipe0 current stat/crop start register           Address offset: 0x704 */
  __IO uint32_t P0CSCSZR;      /*!< Pipe0 current stat/crop size register            Address offset: 0x708 */
  __IO uint32_t RESERVED12[45]; /*!< Reserved,                                 Address offset: 0x70C-0x7BC */
  __IO uint32_t P0CPPCR;       /*!< Pipe0 current pixel packer configuration register      Address offset: 0x700 */
  __IO uint32_t P0CPPM0AR1;    /*!< Pipe0 current pixel packer memory0 address register 1  Address offset: 0x7C4 */
  __IO uint32_t P0CPPM0AR2;    /*!< Pipe0 current pixel packer memory0 address register 2  Address offset: 0x7C8 */
} DCMIPP_TypeDef;

/**
  * @ brief Delay Block
  */
typedef struct
{
  __IO uint32_t CR;   /*!< Delay Block Control Register,       Address offset: 0x00 */
  __IO uint32_t CFGR; /*!< Delay Block Configuration Register, Address offset: 0x04 */
} DLYB_TypeDef;

/**
  * @brief DMA Controller
  */
typedef struct
{
       uint32_t RESERVED1;     /*!< Reserved 1,                                      Address offset: 0x00 */
  __IO uint32_t PRIVCFGR;      /*!< DMA privileged configuration register,           Address offset: 0x04 */
  __IO uint32_t RCFGLOCKR;     /*!< DMA configuration lock register,                 Address offset: 0x08 */
  __IO uint32_t MISR;          /*!< DMA masked interrupt status register,            Address offset: 0x0C */
} DMA_TypeDef;

