RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7r7xx.h
/****************  Bits definition for FLASH_OTPLSR register  *****************/
#define FLASH_OTPLSR_OTPL_Pos                (0U)
#define FLASH_OTPLSR_OTPL_Msk                (0xFFFFUL << FLASH_OTPLSR_OTPL_Pos)                 /*!< 0x0000FFFF */
#define FLASH_OTPLSR_OTPL                    FLASH_OTPLSR_OTPL_Msk                               /*!< OTP lock n (n=0 to 15) */

/***************  Bits definition for FLASH_OTPLSRP register  *****************/
#define FLASH_OTPLSRP_OTPL_Pos               (0U)
#define FLASH_OTPLSRP_OTPL_Msk               (0xFFFFUL << FLASH_OTPLSRP_OTPL_Pos)                /*!< 0x0000FFFF */
#define FLASH_OTPLSRP_OTPL                   FLASH_OTPLSRP_OTPL_Msk                              /*!< OTP lock n (n=0 to 15) */

/****************  Bits definition for FLASH_WRPSR register  ******************/
#define FLASH_WRPSR_WRPS_Pos                 (0U)
#define FLASH_WRPSR_WRPS_Msk                 (0xFFUL << FLASH_WRPSR_WRPS_Pos)                    /*!< 0x000000FF */
#define FLASH_WRPSR_WRPS                     FLASH_WRPSR_WRPS_Msk                                /*!< Write protection for sector n (n=0 to 7) */

/***************  Bits definition for FLASH_WRPSRP register  ******************/
#define FLASH_WRPSRP_WRPS_Pos                (0U)
#define FLASH_WRPSRP_WRPS_Msk                (0xFFUL << FLASH_WRPSRP_WRPS_Pos)                   /*!< 0x000000FF */
#define FLASH_WRPSRP_WRPS                    FLASH_WRPSRP_WRPS_Msk                               /*!< Write protection for sector n (n=0 to 7) */

/****************  Bits definition for FLASH_HDPSR register  ******************/
#define FLASH_HDPSR_HDP_AREA_START_Pos       (0U)
#define FLASH_HDPSR_HDP_AREA_START_Msk       (0xFFUL << FLASH_HDPSR_HDP_AREA_START_Pos)          /*!< 0x000000FF */
#define FLASH_HDPSR_HDP_AREA_START           FLASH_HDPSR_HDP_AREA_START_Msk                      /*!< Hide protection user flash area start */
#define FLASH_HDPSR_HDP_AREA_END_Pos         (16U)
#define FLASH_HDPSR_HDP_AREA_END_Msk         (0xFFUL << FLASH_HDPSR_HDP_AREA_END_Pos)            /*!< 0x00FF0000 */
#define FLASH_HDPSR_HDP_AREA_END             FLASH_HDPSR_HDP_AREA_END_Msk                        /*!< Hide protection user flash area end */

/***************  Bits definition for FLASH_HDPSRP register  ******************/
#define FLASH_HDPSRP_HDP_AREA_START_Pos      (0U)
#define FLASH_HDPSRP_HDP_AREA_START_Msk      (0xFFUL << FLASH_HDPSRP_HDP_AREA_START_Pos)         /*!< 0x000000FF */
#define FLASH_HDPSRP_HDP_AREA_START          FLASH_HDPSRP_HDP_AREA_START_Msk                     /*!< Hide protection user flash area start */
#define FLASH_HDPSRP_HDP_AREA_END_Pos        (16U)
#define FLASH_HDPSRP_HDP_AREA_END_Msk        (0xFFUL << FLASH_HDPSRP_HDP_AREA_END_Pos)           /*!< 0x00FF0000 */
#define FLASH_HDPSRP_HDP_AREA_END            FLASH_HDPSRP_HDP_AREA_END_Msk                       /*!< Hide protection user flash area end */

/***************  Bits definition for FLASH_EPOCHSR register  *****************/
#define FLASH_EPOCHSR_EPOCH_Pos              (0U)
#define FLASH_EPOCHSR_EPOCH_Msk              (0xFFFFFFUL << FLASH_EPOCHSR_EPOCH_Pos)             /*!< 0x00FFFFFF */
#define FLASH_EPOCHSR_EPOCH                  FLASH_EPOCHSR_EPOCH_Msk                             /*!< Epoch */

/**************  Bits definition for FLASH_EPOCHSRP register  *****************/
#define FLASH_EPOCHSRP_EPOCH_Pos             (0U)
#define FLASH_EPOCHSRP_EPOCH_Msk             (0xFFFFFFUL << FLASH_EPOCHSRP_EPOCH_Pos)            /*!< 0x00FFFFFF */
#define FLASH_EPOCHSRP_EPOCH                 FLASH_EPOCHSRP_EPOCH_Msk                            /*!< Epoch */

/****************  Bits definition for FLASH_OBW1SR register  *****************/
#define FLASH_OBW1SR_BOR_LEVEL_Pos           (2U)
#define FLASH_OBW1SR_BOR_LEVEL_Msk           (0x3UL << FLASH_OBW1SR_BOR_LEVEL_Pos)               /*!< 0x0000000C */
#define FLASH_OBW1SR_BOR_LEVEL               FLASH_OBW1SR_BOR_LEVEL_Msk                          /*!< Brownout level */
#define FLASH_OBW1SR_BOR_LEVEL_0             (0x1UL << FLASH_OBW1SR_BOR_LEVEL_Pos)               /*!< 0x00000004 */
#define FLASH_OBW1SR_BOR_LEVEL_1             (0x2UL << FLASH_OBW1SR_BOR_LEVEL_Pos)               /*!< 0x00000008 */
#define FLASH_OBW1SR_IWDG_HW_Pos             (4U)
#define FLASH_OBW1SR_IWDG_HW_Msk             (0x1UL << FLASH_OBW1SR_IWDG_HW_Pos)                 /*!< 0x00000010 */
#define FLASH_OBW1SR_IWDG_HW                 FLASH_OBW1SR_IWDG_HW_Msk                            /*!< Independent watchdog HW control */
#define FLASH_OBW1SR_NRST_STOP_Pos           (6U)
#define FLASH_OBW1SR_NRST_STOP_Msk           (0x1UL << FLASH_OBW1SR_NRST_STOP_Pos)               /*!< 0x00000040 */
#define FLASH_OBW1SR_NRST_STOP               FLASH_OBW1SR_NRST_STOP_Msk                          /*!< Reset on stop mode */
#define FLASH_OBW1SR_NRST_STBY_Pos           (7U)
#define FLASH_OBW1SR_NRST_STBY_Msk           (0x1UL << FLASH_OBW1SR_NRST_STBY_Pos)               /*!< 0x00000080 */
#define FLASH_OBW1SR_NRST_STBY               FLASH_OBW1SR_NRST_STBY_Msk                          /*!< Reset on standby mode */
#define FLASH_OBW1SR_XSPI1_HSLV_Pos          (8U)
#define FLASH_OBW1SR_XSPI1_HSLV_Msk          (0x1UL << FLASH_OBW1SR_XSPI1_HSLV_Pos)              /*!< 0x00000100 */
#define FLASH_OBW1SR_XSPI1_HSLV              FLASH_OBW1SR_XSPI1_HSLV_Msk                         /*!< XSPI1 High-speed at low voltage */
#define FLASH_OBW1SR_XSPI2_HSLV_Pos          (9U)
#define FLASH_OBW1SR_XSPI2_HSLV_Msk          (0x1UL << FLASH_OBW1SR_XSPI2_HSLV_Pos)              /*!< 0x00000200 */
#define FLASH_OBW1SR_XSPI2_HSLV              FLASH_OBW1SR_XSPI2_HSLV_Msk                         /*!< XSPI2 High-speed at low voltage */
#define FLASH_OBW1SR_IWDG_FZ_STOP_Pos        (17U)
#define FLASH_OBW1SR_IWDG_FZ_STOP_Msk        (0x1UL << FLASH_OBW1SR_IWDG_FZ_STOP_Pos)            /*!< 0x00020000 */
#define FLASH_OBW1SR_IWDG_FZ_STOP            FLASH_OBW1SR_IWDG_FZ_STOP_Msk                       /*!< IWDG Stop mode freeze */
#define FLASH_OBW1SR_IWDG_FZ_STBY_Pos        (18U)
#define FLASH_OBW1SR_IWDG_FZ_STBY_Msk        (0x1UL << FLASH_OBW1SR_IWDG_FZ_STBY_Pos)            /*!< 0x00040000 */
#define FLASH_OBW1SR_IWDG_FZ_STBY            FLASH_OBW1SR_IWDG_FZ_STBY_Msk                       /*!< IWDG Standby mode freeze */
#define FLASH_OBW1SR_PERSO_OK_Pos            (28U)
#define FLASH_OBW1SR_PERSO_OK_Msk            (0x1UL << FLASH_OBW1SR_PERSO_OK_Pos)                /*!< 0x10000000 */
#define FLASH_OBW1SR_PERSO_OK                FLASH_OBW1SR_PERSO_OK_Msk                           /*!< Personnalization OK */
#define FLASH_OBW1SR_VDDIO_HSLV_Pos          (29U)
#define FLASH_OBW1SR_VDDIO_HSLV_Msk          (0x1UL << FLASH_OBW1SR_VDDIO_HSLV_Pos)              /*!< 0x20000000 */
#define FLASH_OBW1SR_VDDIO_HSLV              FLASH_OBW1SR_VDDIO_HSLV_Msk                         /*!< I/O High-speed at low voltage */

/***************  Bits definition for FLASH_OBW1SRP register  *****************/
#define FLASH_OBW1SRP_BOR_LEVEL_Pos          (2U)
#define FLASH_OBW1SRP_BOR_LEVEL_Msk          (0x3UL << FLASH_OBW1SRP_BOR_LEVEL_Pos)              /*!< 0x0000000C */
#define FLASH_OBW1SRP_BOR_LEVEL              FLASH_OBW1SRP_BOR_LEVEL_Msk                         /*!< Brownout level */
#define FLASH_OBW1SRP_BOR_LEVEL_0            (0x1UL << FLASH_OBW1SRP_BOR_LEVEL_Pos)              /*!< 0x00000004 */
#define FLASH_OBW1SRP_BOR_LEVEL_1            (0x2UL << FLASH_OBW1SRP_BOR_LEVEL_Pos)              /*!< 0x00000008 */
#define FLASH_OBW1SRP_IWDG_HW_Pos            (4U)
#define FLASH_OBW1SRP_IWDG_HW_Msk            (0x1UL << FLASH_OBW1SRP_IWDG_HW_Pos)                /*!< 0x00000010 */
#define FLASH_OBW1SRP_IWDG_HW                FLASH_OBW1SRP_IWDG_HW_Msk                           /*!< Independent watchdog HW control */
#define FLASH_OBW1SRP_NRST_STOP_Pos          (6U)
#define FLASH_OBW1SRP_NRST_STOP_Msk          (0x1UL << FLASH_OBW1SRP_NRST_STOP_Pos)              /*!< 0x00000040 */
#define FLASH_OBW1SRP_NRST_STOP              FLASH_OBW1SRP_NRST_STOP_Msk                         /*!< Reset on stop mode */
#define FLASH_OBW1SRP_NRST_STBY_Pos          (7U)
#define FLASH_OBW1SRP_NRST_STBY_Msk          (0x1UL << FLASH_OBW1SRP_NRST_STBY_Pos)              /*!< 0x00000080 */
#define FLASH_OBW1SRP_NRST_STBY              FLASH_OBW1SRP_NRST_STBY_Msk                         /*!< Reset on standby mode */
#define FLASH_OBW1SRP_XSPI1_HSLV_Pos         (8U)
#define FLASH_OBW1SRP_XSPI1_HSLV_Msk         (0x1UL << FLASH_OBW1SRP_XSPI1_HSLV_Pos)             /*!< 0x00000100 */
#define FLASH_OBW1SRP_XSPI1_HSLV             FLASH_OBW1SRP_XSPI1_HSLV_Msk                        /*!< XSPI1 High-speed at low voltage */
#define FLASH_OBW1SRP_XSPI2_HSLV_Pos         (9U)
#define FLASH_OBW1SRP_XSPI2_HSLV_Msk         (0x1UL << FLASH_OBW1SRP_XSPI2_HSLV_Pos)             /*!< 0x00000200 */
#define FLASH_OBW1SRP_XSPI2_HSLV             FLASH_OBW1SRP_XSPI2_HSLV_Msk                        /*!< XSPI2 High-speed at low voltage */
#define FLASH_OBW1SRP_IWDG_FZ_STOP_Pos       (17U)
#define FLASH_OBW1SRP_IWDG_FZ_STOP_Msk       (0x1UL << FLASH_OBW1SRP_IWDG_FZ_STOP_Pos)           /*!< 0x00020000 */
#define FLASH_OBW1SRP_IWDG_FZ_STOP           FLASH_OBW1SRP_IWDG_FZ_STOP_Msk                      /*!< IWDG Stop mode freeze */
#define FLASH_OBW1SRP_IWDG_FZ_STBY_Pos       (18U)
#define FLASH_OBW1SRP_IWDG_FZ_STBY_Msk       (0x1UL << FLASH_OBW1SRP_IWDG_FZ_STBY_Pos)           /*!< 0x00040000 */
#define FLASH_OBW1SRP_IWDG_FZ_STBY           FLASH_OBW1SRP_IWDG_FZ_STBY_Msk                      /*!< IWDG Standby mode freeze */
#define FLASH_OBW1SRP_VDDIO_HSLV_Pos         (29U)
#define FLASH_OBW1SRP_VDDIO_HSLV_Msk         (0x1UL << FLASH_OBW1SRP_VDDIO_HSLV_Pos)             /*!< 0x20000000 */
#define FLASH_OBW1SRP_VDDIO_HSLV             FLASH_OBW1SRP_VDDIO_HSLV_Msk                        /*!< I/O High-speed at low voltage */

/****************  Bits definition for FLASH_OBW2SR register  *****************/
#define FLASH_OBW2SR_ITCM_AXI_SHARE_Pos      (0U)
#define FLASH_OBW2SR_ITCM_AXI_SHARE_Msk      (0x7UL << FLASH_OBW2SR_ITCM_AXI_SHARE_Pos)          /*!< 0x00000007 */
#define FLASH_OBW2SR_ITCM_AXI_SHARE          FLASH_OBW2SR_ITCM_AXI_SHARE_Msk                     /*!< ITCM AXI share */
#define FLASH_OBW2SR_ITCM_AXI_SHARE_0        (0x1UL << FLASH_OBW2SR_ITCM_AXI_SHARE_Pos)          /*!< 0x00000001 */
#define FLASH_OBW2SR_ITCM_AXI_SHARE_1        (0x2UL << FLASH_OBW2SR_ITCM_AXI_SHARE_Pos)          /*!< 0x00000002 */
#define FLASH_OBW2SR_ITCM_AXI_SHARE_2        (0x4UL << FLASH_OBW2SR_ITCM_AXI_SHARE_Pos)          /*!< 0x00000004 */
#define FLASH_OBW2SR_DTCM_AXI_SHARE_Pos      (4U)
#define FLASH_OBW2SR_DTCM_AXI_SHARE_Msk      (0x7UL << FLASH_OBW2SR_DTCM_AXI_SHARE_Pos)          /*!< 0x00000070 */
#define FLASH_OBW2SR_DTCM_AXI_SHARE          FLASH_OBW2SR_DTCM_AXI_SHARE_Msk                     /*!< DTCM AXI share */
#define FLASH_OBW2SR_DTCM_AXI_SHARE_0        (0x1UL << FLASH_OBW2SR_DTCM_AXI_SHARE_Pos)          /*!< 0x00000010 */
#define FLASH_OBW2SR_DTCM_AXI_SHARE_1        (0x2UL << FLASH_OBW2SR_DTCM_AXI_SHARE_Pos)          /*!< 0x00000020 */
#define FLASH_OBW2SR_DTCM_AXI_SHARE_2        (0x4UL << FLASH_OBW2SR_DTCM_AXI_SHARE_Pos)          /*!< 0x00000040 */
#define FLASH_OBW2SR_ECC_ON_SRAM_Pos         (8U)
#define FLASH_OBW2SR_ECC_ON_SRAM_Msk         (0x1UL << FLASH_OBW2SR_ECC_ON_SRAM_Pos)             /*!< 0x00000100 */
#define FLASH_OBW2SR_ECC_ON_SRAM             FLASH_OBW2SR_ECC_ON_SRAM_Msk                        /*!< ECC on SRAM */
#define FLASH_OBW2SR_I2C_NI3C_Pos            (9U)
#define FLASH_OBW2SR_I2C_NI3C_Msk            (0x1UL << FLASH_OBW2SR_I2C_NI3C_Pos)                /*!< 0x00000200 */
#define FLASH_OBW2SR_I2C_NI3C                FLASH_OBW2SR_I2C_NI3C_Msk                           /*!< I2C Not I3C */

/***************  Bits definition for FLASH_OBW2SRP register  *****************/
#define FLASH_OBW2SRP_ITCM_AXI_SHARE_Pos     (0U)
#define FLASH_OBW2SRP_ITCM_AXI_SHARE_Msk     (0x7UL << FLASH_OBW2SRP_ITCM_AXI_SHARE_Pos)         /*!< 0x00000007 */
#define FLASH_OBW2SRP_ITCM_AXI_SHARE         FLASH_OBW2SRP_ITCM_AXI_SHARE_Msk                    /*!< ITCM AXI share */
#define FLASH_OBW2SRP_ITCM_AXI_SHARE_0       (0x1UL << FLASH_OBW2SRP_ITCM_AXI_SHARE_Pos)         /*!< 0x00000001 */
#define FLASH_OBW2SRP_ITCM_AXI_SHARE_1       (0x2UL << FLASH_OBW2SRP_ITCM_AXI_SHARE_Pos)         /*!< 0x00000002 */
#define FLASH_OBW2SRP_ITCM_AXI_SHARE_2       (0x4UL << FLASH_OBW2SRP_ITCM_AXI_SHARE_Pos)         /*!< 0x00000004 */
#define FLASH_OBW2SRP_DTCM_AXI_SHARE_Pos     (4U)
#define FLASH_OBW2SRP_DTCM_AXI_SHARE_Msk     (0x7UL << FLASH_OBW2SRP_DTCM_AXI_SHARE_Pos)         /*!< 0x00000070 */
#define FLASH_OBW2SRP_DTCM_AXI_SHARE         FLASH_OBW2SRP_DTCM_AXI_SHARE_Msk                    /*!< DTCM AXI share */
#define FLASH_OBW2SRP_DTCM_AXI_SHARE_0       (0x1UL << FLASH_OBW2SRP_DTCM_AXI_SHARE_Pos)         /*!< 0x00000010 */
#define FLASH_OBW2SRP_DTCM_AXI_SHARE_1       (0x2UL << FLASH_OBW2SRP_DTCM_AXI_SHARE_Pos)         /*!< 0x00000020 */
#define FLASH_OBW2SRP_DTCM_AXI_SHARE_2       (0x4UL << FLASH_OBW2SRP_DTCM_AXI_SHARE_Pos)         /*!< 0x00000040 */
#define FLASH_OBW2SRP_ECC_ON_SRAM_Pos        (8U)
#define FLASH_OBW2SRP_ECC_ON_SRAM_Msk        (0x1UL << FLASH_OBW2SRP_ECC_ON_SRAM_Pos)            /*!< 0x00000100 */
#define FLASH_OBW2SRP_ECC_ON_SRAM            FLASH_OBW2SRP_ECC_ON_SRAM_Msk                       /*!< ECC on SRAM */
#define FLASH_OBW2SRP_I2C_NI3C_Pos           (9U)
#define FLASH_OBW2SRP_I2C_NI3C_Msk           (0x1UL << FLASH_OBW2SRP_I2C_NI3C_Pos)               /*!< 0x00000200 */
#define FLASH_OBW2SRP_I2C_NI3C               FLASH_OBW2SRP_I2C_NI3C_Msk                          /*!< I2C Not I3C */


/******************************************************************************/
/*                                                                            */
/*                          Flexible Memory Controller                        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for FMC_BCR1 register  ********************/
#define FMC_BCR1_CCLKEN_Pos        (20U)
#define FMC_BCR1_CCLKEN_Msk        (0x1UL << FMC_BCR1_CCLKEN_Pos)              /*!< 0x00100000 */
#define FMC_BCR1_CCLKEN            FMC_BCR1_CCLKEN_Msk                         /*!< Continuous clock enable */
#define FMC_BCR1_WFDIS_Pos         (21U)
#define FMC_BCR1_WFDIS_Msk         (0x1UL << FMC_BCR1_WFDIS_Pos)               /*!< 0x00200000 */
#define FMC_BCR1_WFDIS             FMC_BCR1_WFDIS_Msk                          /*!< Write FIFO Disable */
#define FMC_BCR1_BMAP_Pos          (24U)
#define FMC_BCR1_BMAP_Msk          (0x3UL << FMC_BCR1_BMAP_Pos)                /*!< 0x03000000 */
#define FMC_BCR1_BMAP              FMC_BCR1_BMAP_Msk                           /*!< FMC bank mapping */
#define FMC_BCR1_BMAP_0            (0x1UL << FMC_BCR1_BMAP_Pos)                /*!< 0x01000000 */
#define FMC_BCR1_BMAP_1            (0x2UL << FMC_BCR1_BMAP_Pos)                /*!< 0x02000000 */
#define FMC_BCR1_FMCEN_Pos         (31U)
#define FMC_BCR1_FMCEN_Msk         (0x1UL << FMC_BCR1_FMCEN_Pos)               /*!< 0x80000000 */
#define FMC_BCR1_FMCEN             FMC_BCR1_FMCEN_Msk                          /*!< FMC controller enable */

/******************  Bit definition for FMC_BCRx registers (x=1..4)  **********/
#define FMC_BCRx_MBKEN_Pos         (0U)
#define FMC_BCRx_MBKEN_Msk         (0x1UL << FMC_BCRx_MBKEN_Pos)               /*!< 0x00000001 */
#define FMC_BCRx_MBKEN             FMC_BCRx_MBKEN_Msk                          /*!< Memory bank enable bit */
#define FMC_BCRx_MUXEN_Pos         (1U)
#define FMC_BCRx_MUXEN_Msk         (0x1UL << FMC_BCRx_MUXEN_Pos)               /*!< 0x00000002 */
#define FMC_BCRx_MUXEN             FMC_BCRx_MUXEN_Msk                          /*!< Address/data multiplexing enable bit */
#define FMC_BCRx_MTYP_Pos          (2U)
#define FMC_BCRx_MTYP_Msk          (0x3UL << FMC_BCRx_MTYP_Pos)                /*!< 0x0000000C */
#define FMC_BCRx_MTYP              FMC_BCRx_MTYP_Msk                           /*!< Memory type */
#define FMC_BCRx_MTYP_0            (0x1UL << FMC_BCRx_MTYP_Pos)                /*!< 0x00000004 */
#define FMC_BCRx_MTYP_1            (0x2UL << FMC_BCRx_MTYP_Pos)                /*!< 0x00000008 */
#define FMC_BCRx_MWID_Pos          (4U)
#define FMC_BCRx_MWID_Msk          (0x3UL << FMC_BCRx_MWID_Pos)                /*!< 0x00000030 */
#define FMC_BCRx_MWID              FMC_BCRx_MWID_Msk                           /*!< Memory data bus width */
#define FMC_BCRx_MWID_0            (0x1UL << FMC_BCRx_MWID_Pos)                /*!< 0x00000010 */
#define FMC_BCRx_MWID_1            (0x2UL << FMC_BCRx_MWID_Pos)                /*!< 0x00000020 */
#define FMC_BCRx_FACCEN_Pos        (6U)
#define FMC_BCRx_FACCEN_Msk        (0x1UL << FMC_BCRx_FACCEN_Pos)              /*!< 0x00000040 */
#define FMC_BCRx_FACCEN            FMC_BCRx_FACCEN_Msk                         /*!< Flash access enable */
#define FMC_BCRx_BURSTEN_Pos       (8U)
#define FMC_BCRx_BURSTEN_Msk       (0x1UL << FMC_BCRx_BURSTEN_Pos)             /*!< 0x00000100 */
#define FMC_BCRx_BURSTEN           FMC_BCRx_BURSTEN_Msk                        /*!< Burst enable bit */
#define FMC_BCRx_WAITPOL_Pos       (9U)
#define FMC_BCRx_WAITPOL_Msk       (0x1UL << FMC_BCRx_WAITPOL_Pos)             /*!< 0x00000200 */
#define FMC_BCRx_WAITPOL           FMC_BCRx_WAITPOL_Msk                        /*!< Wait signal polarity bit */
#define FMC_BCRx_WAITCFG_Pos       (11U)
#define FMC_BCRx_WAITCFG_Msk       (0x1UL << FMC_BCRx_WAITCFG_Pos)             /*!< 0x00000800 */
#define FMC_BCRx_WAITCFG           FMC_BCRx_WAITCFG_Msk                        /*!< Wait timing configuration */
#define FMC_BCRx_WREN_Pos          (12U)
#define FMC_BCRx_WREN_Msk          (0x1UL << FMC_BCRx_WREN_Pos)                /*!< 0x00001000 */
#define FMC_BCRx_WREN              FMC_BCRx_WREN_Msk                           /*!< Write enable bit */
#define FMC_BCRx_WAITEN_Pos        (13U)
#define FMC_BCRx_WAITEN_Msk        (0x1UL << FMC_BCRx_WAITEN_Pos)              /*!< 0x00002000 */
#define FMC_BCRx_WAITEN            FMC_BCRx_WAITEN_Msk                         /*!< Wait enable bit */
#define FMC_BCRx_EXTMOD_Pos        (14U)
#define FMC_BCRx_EXTMOD_Msk        (0x1UL << FMC_BCRx_EXTMOD_Pos)              /*!< 0x00004000 */
#define FMC_BCRx_EXTMOD            FMC_BCRx_EXTMOD_Msk                         /*!< Extended mode enable */
#define FMC_BCRx_ASYNCWAIT_Pos     (15U)
#define FMC_BCRx_ASYNCWAIT_Msk     (0x1UL << FMC_BCRx_ASYNCWAIT_Pos)           /*!< 0x00008000 */
#define FMC_BCRx_ASYNCWAIT         FMC_BCRx_ASYNCWAIT_Msk                      /*!< Wait signal during asynchronous transfers */
#define FMC_BCRx_CPSIZE_Pos        (16U)
#define FMC_BCRx_CPSIZE_Msk        (0x7UL << FMC_BCRx_CPSIZE_Pos)              /*!< 0x00070000 */
#define FMC_BCRx_CPSIZE            FMC_BCRx_CPSIZE_Msk                         /*!< CRAM page size */
#define FMC_BCRx_CPSIZE_0          (0x1UL << FMC_BCRx_CPSIZE_Pos)              /*!< 0x00010000 */
#define FMC_BCRx_CPSIZE_1          (0x2UL << FMC_BCRx_CPSIZE_Pos)              /*!< 0x00020000 */
#define FMC_BCRx_CPSIZE_2          (0x4UL << FMC_BCRx_CPSIZE_Pos)              /*!< 0x00040000 */
#define FMC_BCRx_CBURSTRW_Pos      (19U)
#define FMC_BCRx_CBURSTRW_Msk      (0x1UL << FMC_BCRx_CBURSTRW_Pos)            /*!< 0x00080000 */
#define FMC_BCRx_CBURSTRW          FMC_BCRx_CBURSTRW_Msk                       /*!< Write burst enable */

