RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7r7xx.h
#define PWR_PDCRN_PDN6_Pos             (6U)
#define PWR_PDCRN_PDN6_Msk             (0x1UL << PWR_PDCRN_PDN6_Pos)           /*!< 0x00000040 */
#define PWR_PDCRN_PDN6                 PWR_PDCRN_PDN6_Msk                      /*!< PDN6: Port N pull-down */

#define PWR_PDCRN_PDN8N11_Pos          (8U)
#define PWR_PDCRN_PDN8N11_Msk          (0x1UL << PWR_PDCRN_PDN8N11_Pos)        /*!< 0x00000100 */
#define PWR_PDCRN_PDN8N11              PWR_PDCRN_PDN8N11_Msk                   /*!< PDN8 to PDN11: Port N pull-down */

#define PWR_PDCRN_PDN12_Pos            (12U)
#define PWR_PDCRN_PDN12_Msk            (0x1UL << PWR_PDCRN_PDN12_Pos)          /*!< 0x00001000 */
#define PWR_PDCRN_PDN12                PWR_PDCRN_PDN12_Msk                     /*!< PDN12: Port N pull-down */

/********************  Bit definition for PWR_PUCRO  register  ********************/
#define PWR_PUCRO_PUO0_Pos             (0U)
#define PWR_PUCRO_PUO0_Msk             (0x1UL << PWR_PUCRO_PUO0_Pos)           /*!< 0x00000001 */
#define PWR_PUCRO_PUO0                 PWR_PUCRO_PUO0_Msk                      /*!< PUO0: Port O pull-up */

#define PWR_PUCRO_PUO1_Pos             (1U)
#define PWR_PUCRO_PUO1_Msk             (0x1UL << PWR_PUCRO_PUO1_Pos)           /*!< 0x00000002 */
#define PWR_PUCRO_PUO1                 PWR_PUCRO_PUO1_Msk                      /*!< PUO1: Port O pull-up */

#define PWR_PUCRO_PUO4_Pos             (4U)
#define PWR_PUCRO_PUO4_Msk             (0x1UL << PWR_PUCRO_PUO4_Pos)           /*!< 0x00000010 */
#define PWR_PUCRO_PUO4                 PWR_PUCRO_PUO4_Msk                      /*!< PUO4: Port O pull-up */

/********************  Bit definition for PWR_PDCRO  register  ********************/
#define PWR_PDCRO_PDO0_Pos             (0U)
#define PWR_PDCRO_PDO0_Msk             (0x1UL << PWR_PDCRO_PDO0_Pos)           /*!< 0x00000001 */
#define PWR_PDCRO_PDO0                 PWR_PDCRO_PDO0_Msk                      /*!< PDO0: Port O pull-down */

#define PWR_PDCRO_PDO1_Pos             (1U)
#define PWR_PDCRO_PDO1_Msk             (0x1UL << PWR_PDCRO_PDO1_Pos)           /*!< 0x00000002 */
#define PWR_PDCRO_PDO1                 PWR_PDCRO_PDO1_Msk                      /*!< PDO1: Port O pull-down */

#define PWR_PDCRO_PDO2_Pos             (2U)
#define PWR_PDCRO_PDO2_Msk             (0x1UL << PWR_PDCRO_PDO2_Pos)           /*!< 0x00000004 */
#define PWR_PDCRO_PDO2                 PWR_PDCRO_PDO2_Msk                      /*!< PDO2: Port O pull-down */

#define PWR_PDCRO_PDO3_Pos             (3U)
#define PWR_PDCRO_PDO3_Msk             (0x1UL << PWR_PDCRO_PDO3_Pos)           /*!< 0x00000008 */
#define PWR_PDCRO_PDO3                 PWR_PDCRO_PDO3_Msk                      /*!< PDO3: Port O pull-down */

#define PWR_PDCRO_PDO4_Pos             (4U)
#define PWR_PDCRO_PDO4_Msk             (0x1UL << PWR_PDCRO_PDO4_Pos)           /*!< 0x00000010 */
#define PWR_PDCRO_PDO4                 PWR_PDCRO_PDO4_Msk                      /*!< PDO4: Port O pull-down */

/********************  Bit definition for PWR_PDCRP  register  ********************/
#define PWR_PDCRP_PDP0P3_Pos           (0U)
#define PWR_PDCRP_PDP0P3_Msk           (0x1UL << PWR_PDCRP_PDP0P3_Pos)         /*!< 0x00000001 */
#define PWR_PDCRP_PDP0P3               PWR_PDCRP_PDP0P3_Msk                    /*!< PPO0 to PP03 : Port P pull-down */

#define PWR_PDCRP_PDP4P7_Pos           (4U)
#define PWR_PDCRP_PDP4P7_Msk           (0x1UL << PWR_PDCRP_PDP4P7_Pos)         /*!< 0x00000010 */
#define PWR_PDCRP_PDP4P7               PWR_PDCRP_PDP4P7_Msk                    /*!< PPO4 to PP07 : Port P pull-down */

#define PWR_PDCRP_PDP8P11_Pos          (8U)
#define PWR_PDCRP_PDP8P11_Msk          (0x1UL << PWR_PDCRP_PDP8P11_Pos)         /*!< 0x00000100 */
#define PWR_PDCRP_PDP8P11              PWR_PDCRP_PDP8P11_Msk                    /*!< PPO8 to PP11 : Port P pull-down */

#define PWR_PDCRP_PDP12P15_Pos         (12U)
#define PWR_PDCRP_PDP12P15_Msk         (0x1UL << PWR_PDCRP_PDP12P15_Pos)       /*!< 0x00001000 */
#define PWR_PDCRP_PDP12P15             PWR_PDCRP_PDP12P15_Msk                  /*!< PP12 to PP15 : Port P pull-down */


/******************************************************************************/
/*                                                                            */
/*                             RAM ECC monitoring                             */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for RAMECC_IER register  ******************/
#define RAMECC_IER_GIE_Pos             (0U)
#define RAMECC_IER_GIE_Msk             (0x1UL << RAMECC_IER_GIE_Pos)           /*!< 0x00000001 */
#define RAMECC_IER_GIE                 RAMECC_IER_GIE_Msk                      /*!< Global interrupt enable */
#define RAMECC_IER_GECCSEIE_Pos        (1U)
#define RAMECC_IER_GECCSEIE_Msk        (0x1UL << RAMECC_IER_GECCSEIE_Pos)      /*!< 0x00000002 */
#define RAMECC_IER_GECCSEIE            RAMECC_IER_GECCSEIE_Msk                 /*!< Global ECC single error interrupt enable */
#define RAMECC_IER_GECCDEIE_Pos        (2U)
#define RAMECC_IER_GECCDEIE_Msk        (0x1UL << RAMECC_IER_GECCDEIE_Pos)      /*!< 0x00000004 */
#define RAMECC_IER_GECCDEIE            RAMECC_IER_GECCDEIE_Msk                 /*!< Global ECC double error interrupt enable */
#define RAMECC_IER_GECCDEBWIE_Pos      (3U)
#define RAMECC_IER_GECCDEBWIE_Msk      (0x1UL << RAMECC_IER_GECCDEBWIE_Pos)    /*!< 0x00000008 */
#define RAMECC_IER_GECCDEBWIE          RAMECC_IER_GECCDEBWIE_Msk               /*!< Global ECC double error on byte write (BW) interrupt enable */

/*******************  Bit definition for RAMECC_CR register  ******************/
#define RAMECC_CR_ECCSEIE_Pos          (2U)
#define RAMECC_CR_ECCSEIE_Msk          (0x1UL << RAMECC_CR_ECCSEIE_Pos)        /*!< 0x00000004 */
#define RAMECC_CR_ECCSEIE              RAMECC_CR_ECCSEIE_Msk                   /*!< ECC single error interrupt enable */
#define RAMECC_CR_ECCDEIE_Pos          (3U)
#define RAMECC_CR_ECCDEIE_Msk          (0x1UL << RAMECC_CR_ECCDEIE_Pos)        /*!< 0x00000008 */
#define RAMECC_CR_ECCDEIE              RAMECC_CR_ECCDEIE_Msk                   /*!< ECC double error interrupt enable */
#define RAMECC_CR_ECCDEBWIE_Pos        (4U)
#define RAMECC_CR_ECCDEBWIE_Msk        (0x1UL << RAMECC_CR_ECCDEBWIE_Pos)      /*!< 0x00000010 */
#define RAMECC_CR_ECCDEBWIE            RAMECC_CR_ECCDEBWIE_Msk                 /*!< ECC double error on byte write (BW) interrupt enable */
#define RAMECC_CR_ECCELEN_Pos          (5U)
#define RAMECC_CR_ECCELEN_Msk          (0x1UL << RAMECC_CR_ECCELEN_Pos)        /*!< 0x00000020 */
#define RAMECC_CR_ECCELEN              RAMECC_CR_ECCELEN_Msk                   /*!< ECC error latching enable */

/*******************  Bit definition for RAMECC_SR register  ******************/
#define RAMECC_SR_SEDCF_Pos            (0U)
#define RAMECC_SR_SEDCF_Msk            (0x1UL << RAMECC_SR_SEDCF_Pos)           /*!< 0x00000001 */
#define RAMECC_SR_SEDCF                RAMECC_SR_SEDCF_Msk                      /*!< ECC single error detected and corrected flag */
#define RAMECC_SR_DEDF_Pos             (1U)
#define RAMECC_SR_DEDF_Msk             (0x1UL << RAMECC_SR_DEDF_Pos)            /*!< 0x00000002 */
#define RAMECC_SR_DEDF                 RAMECC_SR_DEDF_Msk                       /*!< ECC double error detected flag */
#define RAMECC_SR_DEBWDF_Pos           (2U)
#define RAMECC_SR_DEBWDF_Msk           (0x1UL << RAMECC_SR_DEBWDF_Pos)          /*!< 0x00000004 */
#define RAMECC_SR_DEBWDF               RAMECC_SR_DEBWDF_Msk                     /*!< ECC double error on byte write (BW) detected flag */

/******************  Bit definition for RAMECC_FAR register  ******************/
#define RAMECC_FAR_FADD_Pos            (0U)
#define RAMECC_FAR_FADD_Msk            (0xFFFFFFFFUL << RAMECC_FAR_FADD_Pos)    /*!< 0xFFFFFFFF */
#define RAMECC_FAR_FADD                RAMECC_FAR_FADD_Msk                      /*!< ECC error failing address */

/******************  Bit definition for RAMECC_FDRL register  *****************/
#define RAMECC_FDRL_FDATAL_Pos         (0U)
#define RAMECC_FDRL_FDATAL_Msk         (0xFFFFFFFFUL << RAMECC_FDRL_FDATAL_Pos) /*!< 0xFFFFFFFF */
#define RAMECC_FDRL_FDATAL             RAMECC_FDRL_FDATAL_Msk                   /*!< Failing data low */

/******************  Bit definition for RAMECC_FDRH register  *****************/
#define RAMECC_FDRH_FDATAH_Pos         (0U)
#define RAMECC_FDRH_FDATAH_Msk         (0xFFFFFFFFUL << RAMECC_FDRH_FDATAH_Pos) /*!< 0xFFFFFFFF */
#define RAMECC_FDRH_FDATAH             RAMECC_FDRH_FDATAH_Msk                   /* Failing data high (64-bit memory) */

/*****************  Bit definition for RAMECC_FECR register  ******************/
#define RAMECC_FECR_FEC_Pos            (0U)
#define RAMECC_FECR_FEC_Msk            (0xFFFFFFFFUL << RAMECC_FECR_FEC_Pos)   /*!< 0xFFFFFFFF */
#define RAMECC_FECR_FEC                RAMECC_FECR_FEC_Msk                     /*!< Failing error code */


/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RCC_CR register  ********************/
#define RCC_CR_HSION_Pos               (0U)
#define RCC_CR_HSION_Msk               (0x1UL << RCC_CR_HSION_Pos)             /*!< 0x00000001 */
#define RCC_CR_HSION                   RCC_CR_HSION_Msk                        /*!< Internal High Speed clock enable */
#define RCC_CR_HSIKERON_Pos            (1U)
#define RCC_CR_HSIKERON_Msk            (0x1UL << RCC_CR_HSIKERON_Pos)          /*!< 0x00000002 */
#define RCC_CR_HSIKERON                RCC_CR_HSIKERON_Msk                     /*!< Internal High Speed clock enable in Stop mode */
#define RCC_CR_HSIRDY_Pos              (2U)
#define RCC_CR_HSIRDY_Msk              (0x1UL << RCC_CR_HSIRDY_Pos)            /*!< 0x00000004 */
#define RCC_CR_HSIRDY                  RCC_CR_HSIRDY_Msk                       /*!< Internal High Speed clock ready flag */
#define RCC_CR_HSIDIV_Pos              (3U)
#define RCC_CR_HSIDIV_Msk              (0x3UL << RCC_CR_HSIDIV_Pos)            /*!< 0x00000018 */
#define RCC_CR_HSIDIV                  RCC_CR_HSIDIV_Msk                       /*!< Internal High Speed clock divider selection */
#define RCC_CR_HSIDIV_0                (0x1UL << RCC_CR_HSIDIV_Pos)            /*!< 0x00000008 */
#define RCC_CR_HSIDIV_1                (0x2UL << RCC_CR_HSIDIV_Pos)            /*!< 0x00000010 */

#define RCC_CR_HSIDIVF_Pos             (5U)
#define RCC_CR_HSIDIVF_Msk             (0x1UL << RCC_CR_HSIDIVF_Pos)           /*!< 0x00000020 */
#define RCC_CR_HSIDIVF                 RCC_CR_HSIDIVF_Msk                      /*!< HSI Divider flag */
#define RCC_CR_CSION_Pos               (7U)
#define RCC_CR_CSION_Msk               (0x1UL << RCC_CR_CSION_Pos)             /*!< 0x00000080 */
#define RCC_CR_CSION                   RCC_CR_CSION_Msk                        /*!< The Internal RC 4MHz oscillator clock enable */
#define RCC_CR_CSIRDY_Pos              (8U)
#define RCC_CR_CSIRDY_Msk              (0x1UL << RCC_CR_CSIRDY_Pos)            /*!< 0x00000100 */
#define RCC_CR_CSIRDY                  RCC_CR_CSIRDY_Msk                       /*!< The Internal RC 4MHz oscillator clock ready */
#define RCC_CR_CSIKERON_Pos            (9U)
#define RCC_CR_CSIKERON_Msk            (0x1UL << RCC_CR_CSIKERON_Pos)          /*!< 0x00000200 */
#define RCC_CR_CSIKERON                RCC_CR_CSIKERON_Msk                     /*!< Internal RC 4MHz oscillator clock enable in Stop mode */
#define RCC_CR_HSI48ON_Pos             (12U)
#define RCC_CR_HSI48ON_Msk             (0x1UL << RCC_CR_HSI48ON_Pos)           /*!< 0x00001000 */
#define RCC_CR_HSI48ON                 RCC_CR_HSI48ON_Msk                      /*!< HSI48 clock enable clock enable  */
#define RCC_CR_HSI48RDY_Pos            (13U)
#define RCC_CR_HSI48RDY_Msk            (0x1UL << RCC_CR_HSI48RDY_Pos)          /*!< 0x00002000 */
#define RCC_CR_HSI48RDY                RCC_CR_HSI48RDY_Msk                     /*!< HSI48 clock ready flag */
#define RCC_CR_HSEON_Pos               (16U)
#define RCC_CR_HSEON_Msk               (0x1UL << RCC_CR_HSEON_Pos)             /*!< 0x00010000 */
#define RCC_CR_HSEON                   RCC_CR_HSEON_Msk                        /*!< External High Speed clock enable */
#define RCC_CR_HSERDY_Pos              (17U)
#define RCC_CR_HSERDY_Msk              (0x1UL << RCC_CR_HSERDY_Pos)            /*!< 0x00020000 */
#define RCC_CR_HSERDY                  RCC_CR_HSERDY_Msk                       /*!< External High Speed clock ready flag */
#define RCC_CR_HSEBYP_Pos              (18U)
#define RCC_CR_HSEBYP_Msk              (0x1UL << RCC_CR_HSEBYP_Pos)            /*!< 0x00040000 */
#define RCC_CR_HSEBYP                  RCC_CR_HSEBYP_Msk                       /*!< External High Speed clock bypass */
#define RCC_CR_HSEEXT_Pos              (19U)
#define RCC_CR_HSEEXT_Msk              (0x1UL << RCC_CR_HSEEXT_Pos)            /*!< 0x00100000 */
#define RCC_CR_HSEEXT                  RCC_CR_HSEEXT_Msk                       /*!< External High Speed clock type in bypass mode */
#define RCC_CR_HSECSSON_Pos            (20U)
#define RCC_CR_HSECSSON_Msk            (0x1UL << RCC_CR_HSECSSON_Pos)          /*!< 0x00080000 */
#define RCC_CR_HSECSSON                RCC_CR_HSECSSON_Msk                     /*!< HSE Clock security System enable */
#define RCC_CR_PLL1ON_Pos              (24U)
#define RCC_CR_PLL1ON_Msk              (0x1UL << RCC_CR_PLL1ON_Pos)            /*!< 0x01000000 */
#define RCC_CR_PLL1ON                  RCC_CR_PLL1ON_Msk                       /*!< System PLL1 clock enable */
#define RCC_CR_PLL1RDY_Pos             (25U)
#define RCC_CR_PLL1RDY_Msk             (0x1UL << RCC_CR_PLL1RDY_Pos)           /*!< 0x02000000 */
#define RCC_CR_PLL1RDY                 RCC_CR_PLL1RDY_Msk                      /*!< System PLL1 clock ready flag */
#define RCC_CR_PLL2ON_Pos              (26U)
#define RCC_CR_PLL2ON_Msk              (0x1UL << RCC_CR_PLL2ON_Pos)            /*!< 0x04000000 */
#define RCC_CR_PLL2ON                  RCC_CR_PLL2ON_Msk                       /*!< System PLL2 clock enable */
#define RCC_CR_PLL2RDY_Pos             (27U)
#define RCC_CR_PLL2RDY_Msk             (0x1UL << RCC_CR_PLL2RDY_Pos)           /*!< 0x08000000 */
#define RCC_CR_PLL2RDY                 RCC_CR_PLL2RDY_Msk                      /*!< System PLL2 clock ready flag */
#define RCC_CR_PLL3ON_Pos              (28U)
#define RCC_CR_PLL3ON_Msk              (0x1UL << RCC_CR_PLL3ON_Pos)            /*!< 0x10000000 */
#define RCC_CR_PLL3ON                  RCC_CR_PLL3ON_Msk                       /*!< System PLL3 clock enable */
#define RCC_CR_PLL3RDY_Pos             (29U)
#define RCC_CR_PLL3RDY_Msk             (0x1UL << RCC_CR_PLL3RDY_Pos)           /*!< 0x20000000 */
#define RCC_CR_PLL3RDY                 RCC_CR_PLL3RDY_Msk                      /*!< System PLL3 clock ready flag */

/********************  Bit definition for RCC_HSICFGR register  ***************/
/*!< HSICAL configuration */
#define RCC_HSICFGR_HSICAL_Pos         (0U)
#define RCC_HSICFGR_HSICAL_Msk         (0xFFFUL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000FFF */
#define RCC_HSICFGR_HSICAL             RCC_HSICFGR_HSICAL_Msk                  /*!< HSICAL[11:0] bits */
#define RCC_HSICFGR_HSICAL_0           (0x001UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000001 */
#define RCC_HSICFGR_HSICAL_1           (0x002UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000002 */
#define RCC_HSICFGR_HSICAL_2           (0x004UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000004 */
#define RCC_HSICFGR_HSICAL_3           (0x008UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000008 */
#define RCC_HSICFGR_HSICAL_4           (0x010UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000010 */
#define RCC_HSICFGR_HSICAL_5           (0x020UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000020 */
#define RCC_HSICFGR_HSICAL_6           (0x040UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000040 */
#define RCC_HSICFGR_HSICAL_7           (0x080UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000080 */
#define RCC_HSICFGR_HSICAL_8           (0x100UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000100 */
#define RCC_HSICFGR_HSICAL_9           (0x200UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000200 */
#define RCC_HSICFGR_HSICAL_10          (0x400UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000400 */
#define RCC_HSICFGR_HSICAL_11          (0x800UL << RCC_HSICFGR_HSICAL_Pos)     /*!< 0x00000800 */

/*!< HSITRIM configuration */
#define RCC_HSICFGR_HSITRIM_Pos        (24U)
#define RCC_HSICFGR_HSITRIM_Msk        (0x7FUL << RCC_HSICFGR_HSITRIM_Pos)     /*!< 0x7F000000 */
#define RCC_HSICFGR_HSITRIM            RCC_HSICFGR_HSITRIM_Msk                 /*!< HSITRIM[6:0] bits */
#define RCC_HSICFGR_HSITRIM_0          (0x01UL << RCC_HSICFGR_HSITRIM_Pos)     /*!< 0x01000000 */
#define RCC_HSICFGR_HSITRIM_1          (0x02UL << RCC_HSICFGR_HSITRIM_Pos)     /*!< 0x02000000 */
#define RCC_HSICFGR_HSITRIM_2          (0x04UL << RCC_HSICFGR_HSITRIM_Pos)     /*!< 0x04000000 */
#define RCC_HSICFGR_HSITRIM_3          (0x08UL << RCC_HSICFGR_HSITRIM_Pos)     /*!< 0x08000000 */
#define RCC_HSICFGR_HSITRIM_4          (0x10UL << RCC_HSICFGR_HSITRIM_Pos)     /*!< 0x10000000 */
#define RCC_HSICFGR_HSITRIM_5          (0x20UL << RCC_HSICFGR_HSITRIM_Pos)     /*!< 0x20000000 */
#define RCC_HSICFGR_HSITRIM_6          (0x40UL << RCC_HSICFGR_HSITRIM_Pos)     /*!< 0x40000000 */

/********************  Bit definition for RCC_CRRCR register  *****************/
/*!< HSI48CAL configuration */
#define RCC_CRRCR_HSI48CAL_Pos         (0U)
#define RCC_CRRCR_HSI48CAL_Msk         (0x3FFUL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x000003FF */
#define RCC_CRRCR_HSI48CAL             RCC_CRRCR_HSI48CAL_Msk                  /*!< HSI48CAL[9:0] bits */
#define RCC_CRRCR_HSI48CAL_0           (0x001UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000001 */
#define RCC_CRRCR_HSI48CAL_1           (0x002UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000002 */
#define RCC_CRRCR_HSI48CAL_2           (0x004UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000004 */
#define RCC_CRRCR_HSI48CAL_3           (0x008UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000008 */
#define RCC_CRRCR_HSI48CAL_4           (0x010UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000010 */
#define RCC_CRRCR_HSI48CAL_5           (0x020UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000020 */
#define RCC_CRRCR_HSI48CAL_6           (0x040UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000040 */
#define RCC_CRRCR_HSI48CAL_7           (0x080UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000080 */
#define RCC_CRRCR_HSI48CAL_8           (0x100UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000100 */
#define RCC_CRRCR_HSI48CAL_9           (0x200UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000200 */

