RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7r7xx.h
/*******************  Bit definition for WWDG_CFR register  *******************/
#define WWDG_CFR_W_Pos                 (0U)
#define WWDG_CFR_W_Msk                 (0x7FUL << WWDG_CFR_W_Pos)              /*!< 0x0000007F */
#define WWDG_CFR_W                     WWDG_CFR_W_Msk                          /*!<W[6:0] bits (7-bit window value) */
#define WWDG_CFR_W_0                   (0x01UL << WWDG_CFR_W_Pos)              /*!< 0x00000001 */
#define WWDG_CFR_W_1                   (0x02UL << WWDG_CFR_W_Pos)              /*!< 0x00000002 */
#define WWDG_CFR_W_2                   (0x04UL << WWDG_CFR_W_Pos)              /*!< 0x00000004 */
#define WWDG_CFR_W_3                   (0x08UL << WWDG_CFR_W_Pos)              /*!< 0x00000008 */
#define WWDG_CFR_W_4                   (0x10UL << WWDG_CFR_W_Pos)              /*!< 0x00000010 */
#define WWDG_CFR_W_5                   (0x20UL << WWDG_CFR_W_Pos)              /*!< 0x00000020 */
#define WWDG_CFR_W_6                   (0x40UL << WWDG_CFR_W_Pos)              /*!< 0x00000040 */
#define WWDG_CFR_WDGTB_Pos             (11U)
#define WWDG_CFR_WDGTB_Msk             (0x7UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00003800 */
#define WWDG_CFR_WDGTB                 WWDG_CFR_WDGTB_Msk                      /*!<WDGTB[2:0] bits (Timer Base) */
#define WWDG_CFR_WDGTB_0               (0x1UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00000800 */
#define WWDG_CFR_WDGTB_1               (0x2UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00001000 */
#define WWDG_CFR_WDGTB_2               (0x4UL << WWDG_CFR_WDGTB_Pos)           /*!< 0x00002000 */
#define WWDG_CFR_EWI_Pos               (9U)
#define WWDG_CFR_EWI_Msk               (0x1UL << WWDG_CFR_EWI_Pos)             /*!< 0x00000200 */
#define WWDG_CFR_EWI                   WWDG_CFR_EWI_Msk                        /*!<Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF_Pos               (0U)
#define WWDG_SR_EWIF_Msk               (0x1UL << WWDG_SR_EWIF_Pos)             /*!< 0x00000001 */
#define WWDG_SR_EWIF                   WWDG_SR_EWIF_Msk                        /*!<Early Wakeup Interrupt Flag */

/** @} */ /* End of group STM32H7RSxx_Peripheral_Registers_Bits_Definition */

/** @} */ /* End of group STM32H7RSxx_Peripheral_Exported_constants */

/** @addtogroup STM32H7RSxx_Peripheral_Exported_macros
  * @{
  */

/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1) || \
                                       ((INSTANCE) == ADC2))

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC12_COMMON)

/******************************* AXIM ASIB Instances ***************************/
#define IS_AXIM_ASIB_ALL_INSTANCE(INSTANCE)      (((INSTANCE) == AXIM_ASIB_1)  || \
                                                  ((INSTANCE) == AXIM_ASIB_2)  || \
                                                  ((INSTANCE) == AXIM_ASIB_3)  || \
                                                  ((INSTANCE) == AXIM_ASIB_4)  || \
                                                  ((INSTANCE) == AXIM_ASIB_5)  || \
                                                  ((INSTANCE) == AXIM_ASIB_6)  || \
                                                  ((INSTANCE) == AXIM_ASIB_7)  || \
                                                  ((INSTANCE) == AXIM_ASIB_8)  || \
                                                  ((INSTANCE) == AXIM_ASIB_9)  || \
                                                  ((INSTANCE) == AXIM_ASIB_10) || \
                                                  ((INSTANCE) == AXIM_ASIB_11))

/******************************* AXIM AMIB Instances ***************************/
#define IS_AXIM_AMIB_ALL_INSTANCE(INSTANCE)      (((INSTANCE) == AXIM_AMIB_1)  || \
                                                  ((INSTANCE) == AXIM_AMIB_2)  || \
                                                  ((INSTANCE) == AXIM_AMIB_3)  || \
                                                  ((INSTANCE) == AXIM_AMIB_4)  || \
                                                  ((INSTANCE) == AXIM_AMIB_5)  || \
                                                  ((INSTANCE) == AXIM_AMIB_6)  || \
                                                  ((INSTANCE) == AXIM_AMIB_7)  || \
                                                  ((INSTANCE) == AXIM_AMIB_8)  || \
                                                  ((INSTANCE) == AXIM_AMIB_9)  || \
                                                  ((INSTANCE) == AXIM_AMIB_10))

/****************************** CEC Instances *********************************/
#define IS_CEC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CEC)

/******************************* CORDIC Instances *****************************/
#define IS_CORDIC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CORDIC)

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************* DCMIPP Instances *****************************/
#define IS_DCMIPP_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCMIPP)

/******************************* DLYB Instances *******************************/
#define IS_DLYB_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DLYB_SDMMC1)   || \
                                        ((INSTANCE) == DLYB_SDMMC2))

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel0) || \
                                       ((INSTANCE) == GPDMA1_Channel1) || \
                                       ((INSTANCE) == GPDMA1_Channel2) || \
                                       ((INSTANCE) == GPDMA1_Channel3) || \
                                       ((INSTANCE) == GPDMA1_Channel4) || \
                                       ((INSTANCE) == GPDMA1_Channel5) || \
                                       ((INSTANCE) == GPDMA1_Channel6) || \
                                       ((INSTANCE) == GPDMA1_Channel7) || \
                                       ((INSTANCE) == GPDMA1_Channel8) || \
                                       ((INSTANCE) == GPDMA1_Channel9) || \
                                       ((INSTANCE) == GPDMA1_Channel10) || \
                                       ((INSTANCE) == GPDMA1_Channel11) || \
                                       ((INSTANCE) == GPDMA1_Channel12) || \
                                       ((INSTANCE) == GPDMA1_Channel13) || \
                                       ((INSTANCE) == GPDMA1_Channel14) || \
                                       ((INSTANCE) == GPDMA1_Channel15) || \
                                       ((INSTANCE) == HPDMA1_Channel0) || \
                                       ((INSTANCE) == HPDMA1_Channel1) || \
                                       ((INSTANCE) == HPDMA1_Channel2) || \
                                       ((INSTANCE) == HPDMA1_Channel3) || \
                                       ((INSTANCE) == HPDMA1_Channel4) || \
                                       ((INSTANCE) == HPDMA1_Channel5) || \
                                       ((INSTANCE) == HPDMA1_Channel6) || \
                                       ((INSTANCE) == HPDMA1_Channel7) || \
                                       ((INSTANCE) == HPDMA1_Channel8) || \
                                       ((INSTANCE) == HPDMA1_Channel9) || \
                                       ((INSTANCE) == HPDMA1_Channel10) || \
                                       ((INSTANCE) == HPDMA1_Channel11) || \
                                       ((INSTANCE) == HPDMA1_Channel12) || \
                                       ((INSTANCE) == HPDMA1_Channel13) || \
                                       ((INSTANCE) == HPDMA1_Channel14) || \
                                       ((INSTANCE) == HPDMA1_Channel15))

#define IS_GPDMA_INSTANCE(INSTANCE)  (((INSTANCE) == GPDMA1_Channel0) || \
                                      ((INSTANCE) == GPDMA1_Channel1) || \
                                      ((INSTANCE) == GPDMA1_Channel2) || \
                                      ((INSTANCE) == GPDMA1_Channel3) || \
                                      ((INSTANCE) == GPDMA1_Channel4) || \
                                      ((INSTANCE) == GPDMA1_Channel5) || \
                                      ((INSTANCE) == GPDMA1_Channel6) || \
                                      ((INSTANCE) == GPDMA1_Channel7) || \
                                      ((INSTANCE) == GPDMA1_Channel8) || \
                                      ((INSTANCE) == GPDMA1_Channel9) || \
                                      ((INSTANCE) == GPDMA1_Channel10) || \
                                      ((INSTANCE) == GPDMA1_Channel11) || \
                                      ((INSTANCE) == GPDMA1_Channel12) || \
                                      ((INSTANCE) == GPDMA1_Channel13) || \
                                      ((INSTANCE) == GPDMA1_Channel14) || \
                                      ((INSTANCE) == GPDMA1_Channel15))

#define IS_HPDMA_INSTANCE(INSTANCE)   (((INSTANCE) == HPDMA1_Channel0) || \
                                       ((INSTANCE) == HPDMA1_Channel1) || \
                                       ((INSTANCE) == HPDMA1_Channel2) || \
                                       ((INSTANCE) == HPDMA1_Channel3) || \
                                       ((INSTANCE) == HPDMA1_Channel4) || \
                                       ((INSTANCE) == HPDMA1_Channel5) || \
                                       ((INSTANCE) == HPDMA1_Channel6) || \
                                       ((INSTANCE) == HPDMA1_Channel7) || \
                                       ((INSTANCE) == HPDMA1_Channel8) || \
                                       ((INSTANCE) == HPDMA1_Channel9) || \
                                       ((INSTANCE) == HPDMA1_Channel10) || \
                                       ((INSTANCE) == HPDMA1_Channel11) || \
                                       ((INSTANCE) == HPDMA1_Channel12) || \
                                       ((INSTANCE) == HPDMA1_Channel13) || \
                                       ((INSTANCE) == HPDMA1_Channel14) || \
                                       ((INSTANCE) == HPDMA1_Channel15))

#define IS_DMA_2D_ADDRESSING_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel12) || \
                                                 ((INSTANCE) == GPDMA1_Channel13) || \
                                                 ((INSTANCE) == GPDMA1_Channel14) || \
                                                 ((INSTANCE) == GPDMA1_Channel15) || \
                                                 ((INSTANCE) == HPDMA1_Channel12) || \
                                                 ((INSTANCE) == HPDMA1_Channel13) || \
                                                 ((INSTANCE) == HPDMA1_Channel14) || \
                                                 ((INSTANCE) == HPDMA1_Channel15))

#define IS_DMA_PFREQ_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel0)   || \
                                         ((INSTANCE) == GPDMA1_Channel15)  || \
                                         ((INSTANCE) == HPDMA1_Channel15))

/******************************* DMA2D Instances *******************************/
#define IS_DMA2D_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DMA2D)

/******************************* DTS Instances *********************************/
#define IS_DTS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DTS)

